;------------------------------------------------------------------------------
; Assemble with HAS060.X
;------------------------------------------------------------------------------
; filename:    input.h
; version:     1. 0. 0
; author:      SEN::DAC
; Description: 入力処理
; -----------------------------------------------------------------------------
                .include ./input/keycode.h

; -----------------------------------------------------------------------------
                .text
                .even
; -----------------------------------------------------------------------------
; レジスタ定義 (Inside X68000 P.379)
; -----------------------------------------------------------------------------
P8255_PORT_A    equ     $E9A000         ; (.w) ジョイスティック#1
P8255_PORT_B    equ     $E9A002         ; (.w) ジョイスティック#2
P8255_PORT_C    equ     $E9A004         ; (.w) ジョイスティック・コントロール
P8255_CWORD     equ     $E9A006         ; (.w) 8255動作モード/ビット操作

; -----------------------------------------------------------------------------
; 状態定義
; -----------------------------------------------------------------------------
BS_DOW           equ    1               ; 押した瞬間
BS_PUS           equ    2               ; 押し続け
BS_UP_           equ    3               ; 離した瞬間
BS_REL           equ    4               ; 離し続け

; -----------------------------------------------------------------------------
; 各ボタン用のビット定義
; ※ 注：ここに示すビットはソフト側のRAMに対しての物.
;        ジョイスティックレジスタ(0xE9A000)の各ビットとは対応していない.
;        上下左右とABについては一応は対応させているが,
;        STARTとSELECTは対応させると正しく処理ができないので注意.
; -----------------------------------------------------------------------------
BTN_UP_         equ     $0001           ; 上ボタン
BTN_DOW         equ     $0002           ; 下ボタン
BTN_LEF         equ     $0004           ; 左ボタン
BTN_RIG         equ     $0008           ; 右ボタン

BTN_A__         equ     $0020           ; Aボタン(Z純正JOYCARD想定)
BTN_B__         equ     $0040           ; Bボタン(Z純正JOYCARD想定)

BTN_SEL         equ     $0010           ; SELECTボタン(Z純正JOYCARD想定：上下同時押し)
BTN_STA         equ     $0080           ; START ボタン(Z純正JOYCARD想定：左右同時押し)

; -----------------------------------------------------------------------------
; 各ボタン用のビット定義
; キーボード(1P)のみの拡張ボタン
; -----------------------------------------------------------------------------
BTN_C           equ     $0100           ; Cボタン
BTN_D           equ     $0200           ; Dボタン
BTN_E           equ     $0400           ; Eボタン
BTN_F           equ     $0800           ; Fボタン
BTN_G           equ     $1000           ; Gボタン
BTN_H           equ     $2000           ; Hボタン
BTN_I           equ     $4000           ; Iボタン
BTN_J           equ     $8000           ; Jボタン

