;------------------------------------------------------------------------------
; Assemble with HAS060.X
;------------------------------------------------------------------------------
; filename:    keycode.h
; version:     1. 0. 0
; author:      SEN::DAC
; Description: X68000用 BITSNS()で使うキーグループとキーコードを定義
; memo:        [参考資料] C-compiler PRO-68K Cライブラリマニュアル P.176
;------------------------------------------------------------------------------
                .text
                .even
;------------------------------------------------------------------------------
;  KeyGroup
;------------------------------------------------------------------------------
KG_0            equ     $00             ;
KG_1            equ     $01             ;
KG_2            equ     $02             ;
KG_3            equ     $03             ;
KG_4            equ     $04             ;
KG_5            equ     $05             ;
KG_6            equ     $06             ;
KG_7            equ     $07             ;
KG_8            equ     $08             ;
KG_9            equ     $09             ;
KG_A            equ     $0A             ;
KG_B            equ     $0B             ;
KG_C            equ     $0C             ;
KG_D            equ     $0D             ;
KG_E            equ     $0E             ;
;------------------------------------------------------------------------------
;  KeyCode (KeyGroup 0)
;------------------------------------------------------------------------------
; *************************             ; BIT_0 : 未定義
KG_0_ESC        equ     $02             ; BIT_1 : ESC
KG_0_K1_        equ     $04             ; BIT_2 : 1 !
KG_0_K2_        equ     $08             ; BIT_3 : 2 "
KG_0_K3_        equ     $10             ; BIT_4 : 3 #
KG_0_K4_        equ     $20             ; BIT_5 : 4 $
KG_0_K5_        equ     $40             ; BIT_6 : 5 %
KG_0_K6_        equ     $80             ; BIT_7 : 6 &
;------------------------------------------------------------------------------
;  KeyCode (KeyGroup 1)
;------------------------------------------------------------------------------
KG_1_K7_        equ     $01             ; BIT_0 : 7 '
KG_1_K8_        equ     $02             ; BIT_1 : 8 (
KG_1_K9_        equ     $04             ; BIT_2 : 9 )
KG_1_K0_        equ     $08             ; BIT_3 : 0 ﾜ
KG_1_KMI        equ     $10             ; BIT_4 : - =
KG_1_HAT        equ     $20             ; BIT_5 : ^
KG_1_YEN        equ     $40             ; BIT_6 : \ |
KG_1_BS_        equ     $80             ; BIT_7 : BS
;------------------------------------------------------------------------------
;  KeyCode (KeyGroup 2)
;------------------------------------------------------------------------------
KG_2_TAB        equ     $01             ; BIT_0 : TAB
KG_2_Q__        equ     $02             ; BIT_1 : Q
KG_2_W__        equ     $04             ; BIT_2 : W
KG_2_E__        equ     $08             ; BIT_3 : E
KG_2_R__        equ     $10             ; BIT_4 : R
KG_2_T__        equ     $20             ; BIT_5 : T
KG_2_Y__        equ     $40             ; BIT_6 : Y
KG_2_U__        equ     $80             ; BIT_7 : U
;------------------------------------------------------------------------------
;  KeyCode (KeyGroup 3)
;------------------------------------------------------------------------------
KG_3_I__        equ     $01             ; BIT_0 : I
KG_3_O__        equ     $02             ; BIT_1 : O
KG_3_P__        equ     $04             ; BIT_2 : P
KG_3_AT_        equ     $08             ; BIT_3 : @
KG_3_LSB        equ     $10             ; BIT_4 : [
KG_3_ENT        equ     $20             ; BIT_5 : CR (テンキーではない方のENTER)
KG_3_A__        equ     $40             ; BIT_6 : A
KG_3_S__        equ     $80             ; BIT_7 : S
;------------------------------------------------------------------------------
;  KeyCode (KeyGroup 4)
;------------------------------------------------------------------------------
KG_4_D__        equ     $01             ; BIT_0 : D
KG_4_F__        equ     $02             ; BIT_1 : F
KG_4_G__        equ     $04             ; BIT_2 : G
KG_4_H__        equ     $08             ; BIT_3 : H
KG_4_J__        equ     $10             ; BIT_4 : J
KG_4_K__        equ     $20             ; BIT_5 : K
KG_4_L__        equ     $40             ; BIT_6 : L
KG_4_SCO        equ     $80             ; BIT_7 : ;
;------------------------------------------------------------------------------
;  KeyCode (KeyGroup 5)
;------------------------------------------------------------------------------
KG_5_COL        equ     $01             ; BIT_0 : :
KG_5_RSB        equ     $02             ; BIT_1 : ]
KG_5_Z__        equ     $04             ; BIT_2 : Z
KG_5_X__        equ     $08             ; BIT_3 : X
KG_5_C__        equ     $10             ; BIT_4 : C
KG_5_V__        equ     $20             ; BIT_5 : V
KG_5_B__        equ     $40             ; BIT_6 : B
KG_5_N__        equ     $80             ; BIT_7 : N  (マニュアルの M は誤記)
;------------------------------------------------------------------------------
;  KeyCode (KeyGroup 6)
;------------------------------------------------------------------------------
KG_6_M__        equ     $01             ; BIT_0 : M
KG_6_COM        equ     $02             ; BIT_1 : , <
KG_6_DOT        equ     $04             ; BIT_2 : . >
KG_6_SLA        equ     $08             ; BIT_3 : / ?
KG_6_UDB        equ     $10             ; BIT_4 : _
KG_6_SP_        equ     $20             ; BIT_5 : SP (スペース)
KG_6_HOM        equ     $40             ; BIT_6 : HOME
KG_6_DEL        equ     $80             ; BIT_7 : DEL
;------------------------------------------------------------------------------
;  KeyCode (KeyGroup 7)
;------------------------------------------------------------------------------
KG_7_RUP        equ     $01             ; BIT_0 : Roll up
KG_7_RDN        equ     $02             ; BIT_1 : Roll down
KG_7_UND        equ     $04             ; BIT_2 : UNDO
KG_7_LEF        equ     $08             ; BIT_3 : ←
KG_7_UP_        equ     $10             ; BIT_4 : ↑
KG_7_RIG        equ     $20             ; BIT_5 : →
KG_7_DOW        equ     $40             ; BIT_6 : ↓
KG_7_CLR        equ     $80             ; BIT_7 : CLR
;------------------------------------------------------------------------------
;  KeyCode (KeyGroup 8)
;------------------------------------------------------------------------------
KG_8_TSL        equ     $01             ; BIT_0 : / (テンキーの /)
KG_8_TAS        equ     $02             ; BIT_1 : ; (テンキーの ;)
KG_8_TMI        equ     $04             ; BIT_2 : - (テンキーの -)
KG_8_T7_        equ     $08             ; BIT_3 : 7 (テンキーの 7)
KG_8_T8_        equ     $10             ; BIT_4 : 8 (テンキーの 8)
KG_8_T9_        equ     $20             ; BIT_5 : 9 (テンキーの 9)
KG_8_TPL        equ     $40             ; BIT_6 : + (テンキーの +)
KG_8_T4_        equ     $80             ; BIT_7 : 4 (テンキーの 4)
;------------------------------------------------------------------------------
;  KeyCode (KeyGroup 9)
;------------------------------------------------------------------------------
KG_9_T5_        equ     $01             ; BIT_0 : 5 (テンキーの 5)
KG_9_T6_        equ     $02             ; BIT_1 : 6 (テンキーの 6)
KG_9_TEQ        equ     $04             ; BIT_2 : = (テンキーの =)
KG_9_T1_        equ     $08             ; BIT_3 : 1 (テンキーの 1)
KG_9_T2_        equ     $10             ; BIT_4 : 2 (テンキーの 2)
KG_9_T3_        equ     $20             ; BIT_5 : 3 (テンキーの 3)
KG_9_TEN        equ     $40             ; BIT_6 : ENTER (テンキーのENTER)
KG_9_T0_        equ     $80             ; BIT_7 : 0 (補足：テンキーの 0)
;------------------------------------------------------------------------------
;  KeyCode (KeyGroup A)
;------------------------------------------------------------------------------
KG_A_TCM        equ     $01             ; BIT_0 : , (テンキーの ,)
KG_A_TDT        equ     $02             ; BIT_1 : . (テンキーの .)
KG_A_SYM        equ     $04             ; BIT_2 : 記号入力
KG_A_REG        equ     $08             ; BIT_3 : 登録
KG_A_HLP        equ     $10             ; BIT_4 : HELP
KG_A_XF1        equ     $20             ; BIT_5 : XF1
KG_A_XF2        equ     $40             ; BIT_6 : XF2
KG_A_XF3        equ     $80             ; BIT_7 : XF3
;------------------------------------------------------------------------------
;  KeyCode (KeyGroup B)
;------------------------------------------------------------------------------
KG_B_XF4        equ     $01             ; BIT_0 : XF4
KG_B_XF5        equ     $02             ; BIT_1 : XF5
KG_B_KNA        equ     $04             ; BIT_2 : かな
KG_B_RMJ        equ     $08             ; BIT_3 : ローマ字
KG_B_COD        equ     $10             ; BIT_4 : コード入力
KG_B_CAP        equ     $20             ; BIT_5 : CAPS (補足:マニュアルの GAPS は誤記)
KG_B_INS        equ     $40             ; BIT_6 : INS
KG_B_HIR        equ     $80             ; BIT_7 : ひらがな ("稀に"LED点灯時/消灯時にトグル動作する事があった)
;------------------------------------------------------------------------------
;  KeyCode (KeyGroup C)
;------------------------------------------------------------------------------
KG_C_ZEN        equ     $01             ; BIT_0 : 全角
KG_C_BRK        equ     $02             ; BIT_1 : BREAK
KG_C_CPY        equ     $04             ; BIT_2 : COPY (押された場合、自作処理より「プリンタがつながっていません」が優先して出てきてしまう)
KG_C_F1_        equ     $08             ; BIT_3 : F1
KG_C_F2_        equ     $10             ; BIT_4 : F2
KG_C_F3_        equ     $20             ; BIT_5 : F3
KG_C_F4_        equ     $40             ; BIT_6 : F4
KG_C_F5_        equ     $80             ; BIT_7 : F5
;------------------------------------------------------------------------------
;  KeyCode (KeyGroup D)
;------------------------------------------------------------------------------
KG_D_F6_        equ     $01             ; BIT_0 : F6
KG_D_F7_        equ     $02             ; BIT_1 : F7
KG_D_F8_        equ     $04             ; BIT_2 : F8
KG_D_F9_        equ     $08             ; BIT_3 : F9
KG_D_F10        equ     $10             ; BIT_4 : F10
; *************************             ; BIT_5 : 未定義
; *************************             ; BIT_6 : 未定義
; *************************             ; BIT_7 : 未定義
;------------------------------------------------------------------------------
;  KeyCode (KeyGroup E)
;------------------------------------------------------------------------------
KG_E_SHT        equ     $01             ; BIT_0 : SHIFT (左右どちらのSHIFTも反応する)
KG_E_CTR        equ     $02             ; BIT_1 : CTRL  (左上,左下,右,3つあるどれでも反応する)
KG_E_OP1        equ     $04             ; BIT_2 : OPT.1 (自作処理中も OPT.1,2同時押しで電卓が出てくる)
KG_E_OP2        equ     $08             ; BIT_3 : OPT.2 (自作処理中も OPT.1,2同時押しで電卓が出てくる)
; *************************             ; BIT_4 : 未定義
; *************************             ; BIT_5 : 未定義
; *************************             ; BIT_6 : 未定義
; *************************             ; BIT_7 : 未定義

