;------------------------------------------------------------------------------
; Assemble with HAS060.X
;------------------------------------------------------------------------------
; filename:    dma.h
; version:     1. 0. 0
; author:      SEN::DAC
; Description: DMA転送処理
; -----------------------------------------------------------------------------
; -----------------------------------------------------------------------------
                .text
                .even
;------------------------------------------------------------------------------
; DMAパラメータ定義 : 外部公開
;------------------------------------------------------------------------------
;---------------------------------------
; デバイスポートサイズ
;---------------------------------------
DMA_DSP8        equ     $00             ; 8ビットポート  [ハード側(X68000 Z)にバグがあるので未使用]
DMA_DSP16       equ     $08             ; 16ビットポート [標準設定(固定)]

;---------------------------------------
; 転送サイズ
;---------------------------------------
DMA_SIZE1       equ     $01             ; 転送サイズ1バイト(MAR→DAR,オートリクエスト最大速度で固定)
DMA_SIZE2       equ     $11             ; 転送サイズ2バイト(MAR→DAR,オートリクエスト最大速度で固定)
DMA_SIZE4       equ     $21             ; 転送サイズ4バイト(MAR→DAR,オートリクエスト最大速度で固定)

;---------------------------------------
; 転送設定 単体
;---------------------------------------
DMA_ADDR_FIX    equ     %00             ; 転送毎アドレスは固定 00
DMA_ADDR_INC    equ     %01             ; 転送毎アドレスが増加 01
DMA_ADDR_DEC    equ     %10             ; 転送毎アドレスが減少 02

;---------------------------------------
; 転送設定 MAR/DAR 複合
;---------------------------------------
DMA_MfixDfix    equ     %0000           ; MAR：固定 / DAR：固定 00
DMA_MfixDinc    equ     %0001           ; MAR：固定 / DAR：増加 01
DMA_MfixDdec    equ     %0010           ; MAR：固定 / DAR：減少 02

DMA_MincDfix    equ     %0100           ; MAR：増加 / DAR：固定 04
DMA_MincDinc    equ     %0101           ; MAR：増加 / DAR：増加 05
DMA_MincDdec    equ     %0110           ; MAR：増加 / DAR：減少 06

DMA_MdecDfix    equ     %1000           ; MAR：減少 / DAR：固定 08
DMA_MdecDinc    equ     %1001           ; MAR：減少 / DAR：増加 09
DMA_MdecDdec    equ     %1010           ; MAR：減少 / DAR：減少 10
