;------------------------------------------------------------------------------
; Assemble with HAS060.X
;------------------------------------------------------------------------------
; filename:    chktled.s
; version:     1. 0. 0
; author:      SEN::DAC
; Description: TIMER LEDの動作確認
;              動作確認済み環境：EXPERT, X68000 Z(PE), XM6 TypeG
;------------------------------------------------------------------------------
                .68000
;------------------------------------------------------------------------------
                .include iocscall.mac
                .include doscall.mac

;------------------------------------------------------------------------------
                .bss                    ; 初期値なし 0 固定
                .even
;------------------------------------------------------------------------------
ssp_work:       .ds.l   1               ; ssp保存用

;------------------------------------------------------------------------------
                .data                   ; 初期値あり
                .even
;------------------------------------------------------------------------------

;------------------------------------------------------------------------------
                .text
                .even
;------------------------------------------------------------------------------
; アドレス
RTC_MODE        equ     $E8A01B         ; RTC モードレジスタ(Inside X68000 P.152)
RTC_B1CLKOUT    equ     $E8A001         ; RTC BANK1 CLKOUTレジスタ(Inside X68000 P.150)

;------------------------------------------------------------------------------
; メイン処理
;------------------------------------------------------------------------------
main:

; アプリケーション 初期化処理
main_init:
        ; ※RTCモードレジスタ, CLKOUTレジスタは、スーパーバイザ必須.
        clr.l   -(sp)                   ; 引数：0
        DOS     _SUPER                  ; $ff20 スーパーバイザモード ON
        addq.l  #4,sp                   ; sp戻し
        move.l  d0,ssp_work             ; ssp保存

; アプリケーション メインループ
main_loop:
        or.b    #01,RTC_MODE            ; BANK1を指定
        move.b  #05,RTC_B1CLKOUT        ; タイマLEDを1Hzで点滅させる
                                        ; そのまま終了：点滅解除は本体リセットしてください.

; アプリケーション 終了処理
main_release:
        move.l  ssp_work,-(sp)          ; 引数：起動時に保存しておいたssp
        DOS     _SUPER                  ; $ff20 スーパーバイザモード OFF
        addq.l  #4,sp                   ; sp戻し

        DOS     _EXIT                   ; プログラム終了
