;------------------------------------------------------------------------------
; Assemble with HAS060.X
;------------------------------------------------------------------------------
; filename:    se_music.h
; version:     1. 0. 0
; author:      SEN::DAC
; Description: ZMUSICを扱う処理
; 参考資料:    ZM10.MAN
;              ZM11.MAN
;              ZMLIB.HAS
;------------------------------------------------------------------------------
;------------------------------------------------------------------------------
                .text
                .even
;------------------------------------------------------------------------------
;------------------------------------------------------------------------------
; ZMUSIC ファンクションコール用マクロ
;------------------------------------------------------------------------------
ZMUSIC  macro   func_no                 ; ファンクション番号
        moveq.l #func_no,d1
        trap    #3
        endm

;------------------------------------------------------------------------------
; ZMUSIC ファンクション番号
;------------------------------------------------------------------------------
_ZM_INIT        equ     $00             ; m_init           ; 音源,ドライバの初期化(呼ばなくても鳴る)
_ZM_M_STOP      equ     $0a             ; m_stop           ; 演奏停止
_ZM_M_PLAY      equ     $11             ; play_cnv_data    ; 演奏開始
_ZM_SE_PLAY     equ     $14             ; se_adpcm2        ; 登録済み(ZPD)効果音演奏
_ZM_FADE        equ     $1a             ; fade_out         ; 演奏中全トラックフェードイン/アウト
_ZM_REG_ZPD     equ     $39             ; block_adpcm_data ; ZPD登録
_ZM_SET_ZPD     equ     $46             ; set_zpd_tbl      ; ZPDデータの情報を登録する
_ZM_OCCUPIED    equ     $57             ; occupied_size    ; 各バッファの実際の使用容量を返す

;------------------------------------------------------------------------------
; ZPD(ADPCM) 効果音番号
; 注：config.sys にて *.ZPD ファイルが登録済みである事を前提とする.
; DEVICE = \SYS\ZMUSIC.X -ba:xxx.ZPD
;------------------------------------------------------------------------------
SE_NONE         equ     0               ; 無音
SE_ENTER        equ     1               ; カーソル決定
SE_CHOICE       equ     2               ; カーソル選択
SE_B_FIRING     equ     3               ; ボール発射
SE_B_CONTACT    equ     4               ; ボール接触
SE_S_FIRING     equ     5               ; ショット発射
SE_S_CONTACT    equ     6               ; ショット接触
SE_ITEM_BALL    equ     7               ; アイテム取得(ボール)
SE_ITEM_RACKET  equ     8               ; アイテム取得(ラケット)
SE_ITEM_THROUGH equ     9               ; アイテム取得(貫通)
SE_ITEM_SHOT    equ     10              ; アイテム取得(ショット)
SE_MISS         equ     11              ; ミス
SE_STAGE_CLR    equ     12              ; ステージクリア
SE_ALL_CLR      equ     13              ; 全クリア
