;------------------------------------------------------------------------------
; Assemble with HAS060.X
;------------------------------------------------------------------------------
; filename:    fm.s
; version:     1. 0. 0
; author:      SEN::DAC
; Description: FM音源のテスト 音色のパラメータとNOTE(ドレミ)を指定して鳴らす
; memo:        OPMそのものはベロシティ(鍵盤を叩く強さ)に未対応
;------------------------------------------------------------------------------
                .68000
;------------------------------------------------------------------------------
                .include doscall.mac
                .include input/input.h

;------------------------------------------------------------------------------
; 初期値なし 個数指定(連続アドレス) RAM
                .bss
                .even
;------------------------------------------------------------------------------
ssp_work:       .ds.l   1               ; ssp保存用

;------------------------------------------------------------------------------
; 仮想レジスタ(.bss RAM)の配置
;------------------------------------------------------------------------------
; ・仮想レジスタのKONの番号が現物レジスタのKONの下位3ビット(CH.No)に対応している
; ・TEST(LFO-Reset)は現物では$01だが、仮想では$0Bに配置換えしているので注意
;------------------------------------------------------------------------------
; $00 KON(CH.1) ---------> 現物レジスタ：Reserved
; $01 KON(CH.2) ---------> 現物レジスタ：TEST(LFO-Reset)
; $02 KON(CH.3) ---------> 現物レジスタ：Reserved
; $03 KON(CH.4) ---------> 現物レジスタ：Reserved
; $04 KON(CH.5) ---------> 現物レジスタ：Reserved
; $05 KON(CH.6) ---------> 現物レジスタ：Reserved
; $06 KON(CH.7) ---------> 現物レジスタ：Reserved
; $07 KON(CH.8) ---------> 現物レジスタ：Reserved
; $08 Reserved ----------> 現物レジスタ：KON
; $09 Reserved ----------> 現物レジスタ：Reserved
; $0A Reserved ----------> 現物レジスタ：Reserved
; $0B TEST(LFO-Reset) ---> 現物レジスタ：Reserved
; $0C Reserved ----------> 現物レジスタ：Reserved
; $0D Reserved ----------> 現物レジスタ：Reserved
; $0E Reserved ----------> 現物レジスタ：Reserved
; ～以降は現物レジスタマップと同様の配置
;
fm_vreg_top:    .ds.l   256             ; FM音源 仮想レジスタ

;------------------------------------------------------------------------------
; 初期値あり 1個単位指定 RAM
                .data
                .even
;------------------------------------------------------------------------------
;------------------------------------------------------------------------------
; FM音源 パラメータ設定
;
; VOPMの表記と並びに合わせる / VOPMのUIの表記位置, 順に記載
;------------------------------------------------------------------------------
; VOPM画面に無い物 ------------------------------------------------------------
c_lch_en:       .dc.b   1               ; [C]   LchEN     0:OFF / 1:ON (OFFだと左側の音が鳴らない)
c_rch_en:       .dc.b   1               ; [C]   RchEN     0:OFF / 1:ON (OFFだと右側の音が鳴らない)

.if 1
;------------------------------------------------------------------------------
;「bell.fxd」(Num:002)
;------------------------------------------------------------------------------
; VOPM画面 枠外 ---------------------------------------------------------------
c_con:          .dc.b   $04             ; [C]   CON       $00 - $07

; PROG 枠 ---------------------------------------------------------------------
cm_opmsk_m1:    .dc.b   1               ; [C/M] OpMsk-M1  0:OFF / 1:ON
cm_opmsk_c1:    .dc.b   1               ; [C/M] OpMsk-C1  0:OFF / 1:ON
cm_opmsk_m2:    .dc.b   1               ; [C/M] OpMsk-M2  0:OFF / 1:ON
cm_opmsk_c2:    .dc.b   1               ; [C/M] OpMsk-C2  0:OFF / 1:ON

s_ams_en_m1:    .dc.b   0               ; [S]   AMS-En-M1 0:OFF / 1:ON
s_ams_en_c1:    .dc.b   0               ; [S]   AMS-En-C1 0:OFF / 1:ON
s_ams_en_m2:    .dc.b   0               ; [S]   AMS-En-M2 0:OFF / 1:ON
s_ams_en_c2:    .dc.b   0               ; [S]   AMS-En-C2 0:OFF / 1:ON

m_noise_en:     .dc.b   0               ; [M]   Noise     0:OFF / 1:ON

c_fl:           .dc.b   $07             ; [C]   FL        $00 - $07
c_ams:          .dc.b   $00             ; [C]   AMS       $00 - $03
c_pms:          .dc.b   $00             ; [C]   PMS       $00 - $07
m_nfrq:         .dc.b   $00             ; [M]   NFRQ      $00 - $1F

; LFO 枠 ----------------------------------------------------------------------
m_lfo_w:        .dc.b   $00             ; [M]   LFO-W     0:ノコギリ / 1:矩形 / 2:三角 / 3:ノイズ
m_lfrq:         .dc.b   $7F             ; [M]   FRQ       $00 - $FF
m_amd:          .dc.b   $40             ; [M]   AMD       $00 - $7F
m_pmd:          .dc.b   $40             ; [M]   PMD       $00 - $7F

; OP 枠 -----------------------------------------------------------------------
s_tl_m1:        .dc.b   $1B             ; [S]   TL-M1     $00 - $7F
s_tl_c1:        .dc.b   $00             ; [S]   TL-C1     $00 - $7F
s_tl_m2:        .dc.b   $19             ; [S]   TL-M2     $00 - $7F
s_tl_c2:        .dc.b   $00             ; [S]   TL-C2     $00 - $7F

s_ar_m1:        .dc.b   $15             ; [S]   AR-M1     $00 - $1F
s_ar_c1:        .dc.b   $1F             ; [S]   AR-C1     $00 - $1F
s_ar_m2:        .dc.b   $15             ; [S]   AR-M2     $00 - $1F
s_ar_c2:        .dc.b   $1F             ; [S]   AR-C2     $00 - $1F

s_d1r_m1:       .dc.b   $0F             ; [S]   D1R-M1    $00 - $1F
s_d1r_c1:       .dc.b   $0D             ; [S]   D1R-C1    $00 - $1F
s_d1r_m2:       .dc.b   $0F             ; [S]   D1R-M2    $00 - $1F
s_d1r_c2:       .dc.b   $0D             ; [S]   D1R-C2    $00 - $1F

s_d1l_m1:       .dc.b   $03             ; [S]   D1L-M1    $00 - $0F
s_d1l_c1:       .dc.b   $04             ; [S]   D1L-C1    $00 - $0F
s_d1l_m2:       .dc.b   $03             ; [S]   D1L-M2    $00 - $0F
s_d1l_c2:       .dc.b   $04             ; [S]   D1L-C2    $00 - $0F

s_d2r_m1:       .dc.b   $08             ; [S]   D2R-M1    $00 - $1F
s_d2r_c1:       .dc.b   $05             ; [S]   D2R-C1    $00 - $1F
s_d2r_m2:       .dc.b   $08             ; [S]   D2R-M2    $00 - $1F
s_d2r_c2:       .dc.b   $05             ; [S]   D2R-C2    $00 - $1F

s_rr_m1:        .dc.b   $00             ; [S]   RR-M1     $00 - $0F
s_rr_c1:        .dc.b   $06             ; [S]   RR-C1     $00 - $0F
s_rr_m2:        .dc.b   $00             ; [S]   RR-M2     $00 - $0F
s_rr_c2:        .dc.b   $06             ; [S]   RR-C2     $00 - $0F

s_ks_m1:        .dc.b   $01             ; [S]   KS-M1     $00 - $03
s_ks_c1:        .dc.b   $01             ; [S]   KS-C1     $00 - $03
s_ks_m2:        .dc.b   $01             ; [S]   KS-M2     $00 - $03
s_ks_c2:        .dc.b   $01             ; [S]   KS-C2     $00 - $03

s_mul_m1:       .dc.b   $08             ; [S]   MUL-M1    $00 - $0F
s_mul_c1:       .dc.b   $04             ; [S]   MUL-C1    $00 - $0F
s_mul_m2:       .dc.b   $06             ; [S]   MUL-M2    $00 - $0F
s_mul_c2:       .dc.b   $03             ; [S]   MUL-C2    $00 - $0F

s_dt1_m1:       .dc.b   $03             ; [S]   DT1-M1    $00 - $07
s_dt1_c1:       .dc.b   $03             ; [S]   DT1-C1    $00 - $07
s_dt1_m2:       .dc.b   $07             ; [S]   DT1-M2    $00 - $07
s_dt1_c2:       .dc.b   $07             ; [S]   DT1-C2    $00 - $07

s_dt2_m1:       .dc.b   $00             ; [S]   DT2-M1    $00 - $03
s_dt2_c1:       .dc.b   $00             ; [S]   DT2-C1    $00 - $03
s_dt2_m2:       .dc.b   $00             ; [S]   DT2-M2    $00 - $03
s_dt2_c2:       .dc.b   $00             ; [S]   DT2-C2    $00 - $03

.else

;------------------------------------------------------------------------------
;「Guitar.fxd」(Num:006)
;------------------------------------------------------------------------------
; VOPM画面 枠外 ---------------------------------------------------------------
c_con:          .dc.b   $00             ; [C]   CON       $00 - $07

; PROG 枠 ---------------------------------------------------------------------
cm_opmsk_m1:    .dc.b   1               ; [C/M] OpMsk-M1  0:OFF / 1:ON
cm_opmsk_c1:    .dc.b   1               ; [C/M] OpMsk-C1  0:OFF / 1:ON
cm_opmsk_m2:    .dc.b   1               ; [C/M] OpMsk-M2  0:OFF / 1:ON
cm_opmsk_c2:    .dc.b   1               ; [C/M] OpMsk-C2  0:OFF / 1:ON

s_ams_en_m1:    .dc.b   0               ; [S]   AMS-En-M1 0:OFF / 1:ON
s_ams_en_c1:    .dc.b   0               ; [S]   AMS-En-C1 0:OFF / 1:ON
s_ams_en_m2:    .dc.b   0               ; [S]   AMS-En-M2 0:OFF / 1:ON
s_ams_en_c2:    .dc.b   0               ; [S]   AMS-En-C2 0:OFF / 1:ON

m_noise_en:     .dc.b   0               ; [M]   Noise     0:OFF / 1:ON

c_fl:           .dc.b   $07             ; [C]   FL        $00 - $07
c_ams:          .dc.b   $00             ; [C]   AMS       $00 - $03
c_pms:          .dc.b   $00             ; [C]   PMS       $00 - $07
m_nfrq:         .dc.b   $00             ; [M]   NFRQ      $00 - $1F

; LFO 枠 ----------------------------------------------------------------------
m_lfo_w:        .dc.b   $00             ; [M]   LFO-W     0:ノコギリ / 1:矩形 / 2:三角 / 3:ノイズ
m_lfrq:         .dc.b   $7F             ; [M]   FRQ       $00 - $FF
m_amd:          .dc.b   $40             ; [M]   AMD       $00 - $7F
m_pmd:          .dc.b   $40             ; [M]   PMD       $00 - $7F

; OP 枠 -----------------------------------------------------------------------
s_tl_m1:        .dc.b   $1A             ; [S]   TL-M1     $00 - $7F
s_tl_c1:        .dc.b   $1B             ; [S]   TL-C1     $00 - $7F
s_tl_m2:        .dc.b   $1A             ; [S]   TL-M2     $00 - $7F
s_tl_c2:        .dc.b   $00             ; [S]   TL-C2     $00 - $7F

s_ar_m1:        .dc.b   $10             ; [S]   AR-M1     $00 - $1F
s_ar_c1:        .dc.b   $13             ; [S]   AR-C1     $00 - $1F
s_ar_m2:        .dc.b   $1A             ; [S]   AR-M2     $00 - $1F
s_ar_c2:        .dc.b   $1B             ; [S]   AR-C2     $00 - $1F

s_d1r_m1:       .dc.b   $0F             ; [S]   D1R-M1    $00 - $1F
s_d1r_c1:       .dc.b   $1F             ; [S]   D1R-C1    $00 - $1F
s_d1r_m2:       .dc.b   $1F             ; [S]   D1R-M2    $00 - $1F
s_d1r_c2:       .dc.b   $1F             ; [S]   D1R-C2    $00 - $1F

s_d1l_m1:       .dc.b   $03             ; [S]   D1L-M1    $00 - $0F
s_d1l_c1:       .dc.b   $00             ; [S]   D1L-C1    $00 - $0F
s_d1l_m2:       .dc.b   $00             ; [S]   D1L-M2    $00 - $0F
s_d1l_c2:       .dc.b   $00             ; [S]   D1L-C2    $00 - $0F

s_d2r_m1:       .dc.b   $01             ; [S]   D2R-M1    $00 - $1F
s_d2r_c1:       .dc.b   $01             ; [S]   D2R-C1    $00 - $1F
s_d2r_m2:       .dc.b   $01             ; [S]   D2R-M2    $00 - $1F
s_d2r_c2:       .dc.b   $01             ; [S]   D2R-C2    $00 - $1F

s_rr_m1:        .dc.b   $03             ; [S]   RR-M1     $00 - $0F
s_rr_c1:        .dc.b   $03             ; [S]   RR-C1     $00 - $0F
s_rr_m2:        .dc.b   $03             ; [S]   RR-M2     $00 - $0F
s_rr_c2:        .dc.b   $08             ; [S]   RR-C2     $00 - $0F

s_ks_m1:        .dc.b   $00             ; [S]   KS-M1     $00 - $03
s_ks_c1:        .dc.b   $00             ; [S]   KS-C1     $00 - $03
s_ks_m2:        .dc.b   $00             ; [S]   KS-M2     $00 - $03
s_ks_c2:        .dc.b   $00             ; [S]   KS-C2     $00 - $03

s_mul_m1:       .dc.b   $03             ; [S]   MUL-M1    $00 - $0F
s_mul_c1:       .dc.b   $01             ; [S]   MUL-C1    $00 - $0F
s_mul_m2:       .dc.b   $01             ; [S]   MUL-M2    $00 - $0F
s_mul_c2:       .dc.b   $01             ; [S]   MUL-C2    $00 - $0F

s_dt1_m1:       .dc.b   $03             ; [S]   DT1-M1    $00 - $07
s_dt1_c1:       .dc.b   $00             ; [S]   DT1-C1    $00 - $07
s_dt1_m2:       .dc.b   $FF             ; [S]   DT1-M2    $00 - $07
s_dt1_c2:       .dc.b   $00             ; [S]   DT1-C2    $00 - $07

s_dt2_m1:       .dc.b   $00             ; [S]   DT2-M1    $00 - $03
s_dt2_c1:       .dc.b   $00             ; [S]   DT2-C1    $00 - $03
s_dt2_m2:       .dc.b   $00             ; [S]   DT2-M2    $00 - $03
s_dt2_c2:       .dc.b   $00             ; [S]   DT2-C2    $00 - $03
.endif

;------------------------------------------------------------------------------
                .text
                .even
;------------------------------------------------------------------------------
; FM音源 ポートアドレス定義
;------------------------------------------------------------------------------
FM_SEL          equ     $E90001         ; FM音源 現物レジスタ番号設定ポート
FM_DAT          equ     $E90003         ; FM音源 データR/Wポート

;------------------------------------------------------------------------------
; パラメータ設定 [C] KC ($28[CH.1]～$2F[CH.8])
;------------------------------------------------------------------------------
_F_KC           .macro prm,index

        lea     fm_vreg_top,a0          ; a0 = 仮想レジスタ先頭アドレス
        move.w  index,d1                ; index(レジスタ番号)

        move.b  prm,(a0,d1.w)           ; 仮想レジスタに書き込み
        _F_SREG prm,index               ; 現物レジスタに書き込み

                .endm

;------------------------------------------------------------------------------
; パラメータ設定 [C] L-chEN ON/OFF ($20[CH.1]～$27[CH.8])
;------------------------------------------------------------------------------
_F_LCEN         .macro prm,index

        move.b  prm,d0                  ; パラメータ
        rol.b   #6,d0                   ; 7ビット左シフト(はみ出した分は反対側から出てくる)
        andi.b  #%0100_0000,d0          ; パラメータから当該ビット以外をクリア

        lea     fm_vreg_top,a0          ; a0 = 仮想レジスタ先頭アドレス
        move.w  index,d1                ; index(レジスタ番号)

        move.b  (a0,d1.w),d2            ; d2 = fm_mir_top[index];
        andi.b  #%1011_1111,d2          ; 仮想レジスタ値からパラメータの当該ビットをクリア

        or.b    d0,d2                   ; パラメータを仮想レジスタ値に合成
        move.b  d2,(a0,d1.w)            ; 仮想レジスタに書き込み
        _F_SREG d2,index                ; 現物レジスタに書き込み

                .endm

;------------------------------------------------------------------------------
; パラメータ設定 [C] R-chEN ON/OFF ($20[CH.1]～$27[CH.8])
;------------------------------------------------------------------------------
_F_RCEN         .macro prm,index

        move.b  prm,d0                  ; パラメータ
        rol.b   #7,d0                   ; 7ビット左シフト(はみ出した分は反対側から出てくる)
        andi.b  #%1000_0000,d0          ; パラメータから当該ビット以外をクリア

        lea     fm_vreg_top,a0          ; a0 = 仮想レジスタ先頭アドレス
        move.w  index,d1                ; index(レジスタ番号)

        move.b  (a0,d1.w),d2            ; d2 = fm_mir_top[index];
        andi.b  #%0111_1111,d2          ; 仮想レジスタ値からパラメータの当該ビットをクリア

        or.b    d0,d2                   ; パラメータを仮想レジスタ値に合成
        move.b  d2,(a0,d1.w)            ; 仮想レジスタに書き込み
        _F_SREG d2,index                ; 現物レジスタに書き込み

                .endm

;------------------------------------------------------------------------------
; パラメータ設定 [C/M] KON-M1 ON/OFF 仮想($00[CH.1]～$07[CH.8]) / 現物($08)
;------------------------------------------------------------------------------
; ※ 仮想レジスタのindexを指定すること
;------------------------------------------------------------------------------
_F_M1SW         .macro prm,index

        move.b  prm,d0                  ; パラメータ
        rol.b   #3,d0                   ; 3ビット左シフト(はみ出した分は反対側から出てくる)
        andi.b  #%0000_1000,d0          ; パラメータから当該ビット以外をクリア

        lea     fm_vreg_top,a0          ; a0 = 仮想レジスタ先頭アドレス
        move.w  index,d1                ; index(レジスタ番号)
        andi.w  #%00000000_00000111,d1  ; indexの当該ビット以外をクリア

        move.b  (a0,d1.w),d2            ; d2 = fm_mir_top[index];
        andi.b  #%0111_0000,d2          ; 仮想レジスタ値からリザーブ,パラメータ,CH.番号の当該ビットをクリア

        or.b    d0,d2                   ; パラメータを仮想レジスタ値に合成
        or.b    d1,d2                   ; CH.番号を仮想レジスタ値に合成
        move.b  d2,(a0,d1.w)            ; 仮想レジスタに書き込み
                                        ; ※ 現物レジスタには書き込まない

                .endm

;------------------------------------------------------------------------------
; パラメータ設定 [C/M] KON-C1 ON/OFF 仮想($00[CH.1]～$07[CH.8]) / 現物($08)
;------------------------------------------------------------------------------
; ※ 仮想レジスタのindexを指定すること
;------------------------------------------------------------------------------
_F_C1SW         .macro prm,index

        move.b  prm,d0                  ; パラメータ
        rol.b   #5,d0                   ; 5ビット左シフト(はみ出した分は反対側から出てくる)
        andi.b  #%0010_0000,d0          ; パラメータから当該ビット以外をクリア

        lea     fm_vreg_top,a0          ; a0 = 仮想レジスタ先頭アドレス
        move.w  index,d1                ; index(レジスタ番号)
        andi.w  #%00000000_00000111,d1  ; indexの当該ビット以外をクリア

        move.b  (a0,d1.w),d2            ; d2 = fm_mir_top[index];
        andi.b  #%0101_1000,d2          ; 仮想レジスタ値からリザーブ,パラメータ,CH.番号の当該ビットをクリア

        or.b    d0,d2                   ; パラメータを仮想レジスタ値に合成
        or.b    d1,d2                   ; CH.番号を仮想レジスタ値に合成
        move.b  d2,(a0,d1.w)            ; 仮想レジスタに書き込み
                                        ; ※ 現物レジスタには書き込まない

                .endm

;------------------------------------------------------------------------------
; パラメータ設定 [C/M] KON-M2 ON/OFF 仮想($00[CH.1]～$07[CH.8]) / 現物($08)
;------------------------------------------------------------------------------
; ※ 仮想レジスタのindexを指定すること
;------------------------------------------------------------------------------
_F_M2SW         .macro prm,index

        move.b  prm,d0                  ; パラメータ
        rol.b   #4,d0                   ; 4ビット左シフト(はみ出した分は反対側から出てくる)
        andi.b  #%0001_0000,d0          ; パラメータから当該ビット以外をクリア

        lea     fm_vreg_top,a0          ; a0 = 仮想レジスタ先頭アドレス
        move.w  index,d1                ; index(レジスタ番号)
        andi.w  #%00000000_00000111,d1  ; indexの当該ビット以外をクリア

        move.b  (a0,d1.w),d2            ; d2 = fm_mir_top[index];
        andi.b  #%0110_1000,d2          ; 仮想レジスタ値からリザーブ,パラメータ,CH.番号の当該ビットをクリア

        or.b    d0,d2                   ; パラメータを仮想レジスタ値に合成
        or.b    d1,d2                   ; CH.番号を仮想レジスタ値に合成
        move.b  d2,(a0,d1.w)            ; 仮想レジスタに書き込み
                                        ; ※ 現物レジスタには書き込まない

                .endm

;------------------------------------------------------------------------------
; パラメータ設定 [C/M] KON-C2 ON/OFF 仮想($00[CH.1]～$07[CH.8]) / 現物($08)
;------------------------------------------------------------------------------
; ※ 仮想レジスタのindexを指定すること
;------------------------------------------------------------------------------
_F_C2SW         .macro prm,index

        move.b  prm,d0                  ; パラメータ
        rol.b   #6,d0                   ; 6ビット左シフト(はみ出した分は反対側から出てくる)
        andi.b  #%0100_0000,d0          ; パラメータから当該ビット以外をクリア

        lea     fm_vreg_top,a0          ; a0 = 仮想レジスタ先頭アドレス
        move.w  index,d1                ; index(レジスタ番号)
        andi.w  #%00000000_00000111,d1  ; indexの当該ビット以外をクリア

        move.b  (a0,d1.w),d2            ; d2 = fm_mir_top[index];
        andi.b  #%0011_1000,d2          ; 仮想レジスタ値からリザーブ,パラメータ,CH.番号の当該ビットをクリア

        or.b    d0,d2                   ; パラメータを仮想レジスタ値に合成
        or.b    d1,d2                   ; CH.番号を仮想レジスタ値に合成
        move.b  d2,(a0,d1.w)            ; 仮想レジスタに書き込み
                                        ; ※ 現物レジスタには書き込まない

                .endm

;------------------------------------------------------------------------------
; パラメータ設定 [C/M] KON-M1,C1,M2,C2 まとめて ON/OFF 仮想($00[CH.1]～$07[CH.8]) / 現物($08)
;------------------------------------------------------------------------------
; ※ 仮想レジスタのindexを指定すること
;------------------------------------------------------------------------------
_F_OPSW         .macro prm,index

        move.b  prm,d0                  ; パラメータ
        rol.b   #3,d0                   ; 3ビット左シフト(はみ出した分は反対側から出てくる)
        andi.b  #%0111_1000,d0          ; パラメータから当該ビット以外をクリア

        move.w  index,d1                ; index(レジスタ番号)
        andi.w  #%00000000_00000111,d1  ; indexの当該ビット以外をクリア

        or.b    d1,d0                   ; CH.番号をパラメータに合成
        lea     fm_vreg_top,a0          ; a0 = 仮想レジスタ先頭アドレス
        move.b  d0,(a0,d1.w)            ; 仮想レジスタに書き込み
                                        ; ※ 現物レジスタには書き込まない

                .endm

;------------------------------------------------------------------------------
; 仮想KON設定値を現物[M]KONに反映させる (鍵盤押下)：仮想($00[CH.1]～$07[CH.8]) / 現物($08)
;------------------------------------------------------------------------------
; ※ 仮想レジスタのindexを指定すること
;------------------------------------------------------------------------------
_F_KON          .macro index

        lea     fm_vreg_top,a0          ; a0 = 仮想レジスタ先頭アドレス
        move.w  index,d1                ; index(レジスタ番号)
        move.b  (a0,d1.w),d0            ; d2 = fm_mir_top[index];

        _F_SREG d0,#$08                 ; 現物レジスタに書き込み

                .endm

;------------------------------------------------------------------------------
; 現物KONのOPを全てOFF (鍵盤離上)：仮想($00[CH.1]～$07[CH.8]) / 現物($08)
;------------------------------------------------------------------------------
; ※ 仮想レジスタのindexを指定すること
; ※ indexは、チャンネル番号以外は0を埋めておくこと
;------------------------------------------------------------------------------
_F_KOFF         .macro index

        _F_SREG index,#$08              ; 現物レジスタに書き込み

                .endm

;------------------------------------------------------------------------------
; パラメータ設定 [C] CON ($20[CH.1]～$27[CH.8])
;------------------------------------------------------------------------------
_F_CON          .macro prm,index

        move.b  prm,d0                  ; パラメータ
        andi.b  #%0000_0111,d0          ; パラメータから当該ビット以外をクリア

        lea     fm_vreg_top,a0          ; a0 = 仮想レジスタ先頭アドレス
        move.w  index,d1                ; index(レジスタ番号)
        move.b  (a0,d1.w),d2            ; d2 = fm_mir_top[index];
        andi.b  #%1111_1000,d2          ; 仮想レジスタ値からパラメータの当該ビットをクリア

        or.b    d0,d2                   ; パラメータを仮想レジスタ値に合成
        move.b  d2,(a0,d1.w)            ; 仮想レジスタに書き込み
        _F_SREG d2,index                ; 現物レジスタに書き込み

                .endm

;------------------------------------------------------------------------------
; パラメータ設定 [S] AMS-Enable ($A0[SLOT1]～$BF[SLOT32])
;------------------------------------------------------------------------------
_F_AMSE         .macro prm,index

        move.b  prm,d0                  ; パラメータ
        rol.b   #7,d0                   ; 7ビット左シフト(はみ出した分は反対側から出てくる)
        andi.b  #%1000_0000,d0          ; パラメータから当該ビット以外をクリア

        lea     fm_vreg_top,a0          ; a0 = 仮想レジスタ先頭アドレス
        move.w  index,d1                ; index(レジスタ番号)
        move.b  (a0,d1.w),d2            ; d2 = fm_mir_top[index];
        andi.b  #%0111_1111,d2          ; 仮想レジスタ値からパラメータの当該ビットをクリア

        or.b    d0,d2                   ; パラメータを仮想レジスタ値に合成
        move.b  d2,(a0,d1.w)            ; 仮想レジスタに書き込み
        _F_SREG d2,index                ; 現物レジスタに書き込み

                .endm

;------------------------------------------------------------------------------
; パラメータ設定 [M] Noise-Enable ($0F)
;------------------------------------------------------------------------------
_F_NE           .macro prm

        move.b  prm,d0                  ; パラメータ
        rol.b   #7,d0                   ; 7ビット左シフト(はみ出した分は反対側から出てくる)
        andi.b  #%1000_0000,d0          ; パラメータから当該ビット以外をクリア

        lea     fm_vreg_top,a0          ; a0 = 仮想レジスタ先頭アドレス
        move.w  #$000F,d1               ; index(レジスタ番号)はOPM内に1つしかない($0F)
        move.b  (a0,d1.w),d2            ; d2 = fm_mir_top[index];
        andi.b  #%0111_1111,d2          ; 仮想レジスタ値からパラメータの当該ビットをクリア

        or.b    d0,d2                   ; パラメータを仮想レジスタ値に合成
        move.b  d2,(a0,d1.w)            ; 仮想レジスタに書き込み
        _F_SREG d2,#$0F                 ; 現物レジスタに書き込み

                .endm

;------------------------------------------------------------------------------
; パラメータ設定 [C] FL ($20[CH.1]～$27[CH.8])
;------------------------------------------------------------------------------
_F_FL           .macro prm,index

        move.b  prm,d0                  ; パラメータ
        rol.b   #3,d0                   ; 3ビット左シフト(はみ出した分は反対側から出てくる)
        andi.b  #%0011_1000,d0          ; パラメータから当該ビット以外をクリア

        lea     fm_vreg_top,a0          ; a0 = 仮想レジスタ先頭アドレス
        move.w  index,d1                ; index(レジスタ番号)
        move.b  (a0,d1.w),d2            ; d2 = fm_mir_top[index];
        andi.b  #%1100_0111,d2          ; 仮想レジスタ値からパラメータの当該ビットをクリア

        or.b    d0,d2                   ; パラメータを仮想レジスタ値に合成
        move.b  d2,(a0,d1.w)            ; 仮想レジスタに書き込み
        _F_SREG d2,index                ; 現物レジスタに書き込み

                .endm

;------------------------------------------------------------------------------
; パラメータ設定 [C] AMS ($38[CH.1]～$3F[CH.8])
;------------------------------------------------------------------------------
_F_AMS          .macro prm,index

        move.b  prm,d0                  ; パラメータ
        andi.b  #%0000_0011,d0          ; パラメータから当該ビット以外をクリア

        lea     fm_vreg_top,a0          ; a0 = 仮想レジスタ先頭アドレス
        move.w  index,d1                ; index(レジスタ番号)
        move.b  (a0,d1.w),d2            ; d2 = fm_mir_top[index];
        andi.b  #%1111_1100,d2          ; 仮想レジスタ値からパラメータの当該ビットをクリア

        or.b    d0,d2                   ; パラメータを仮想レジスタ値に合成
        move.b  d2,(a0,d1.w)            ; 仮想レジスタに書き込み
        _F_SREG d2,index                ; 現物レジスタに書き込み

                .endm

;------------------------------------------------------------------------------
; パラメータ設定 [C] PMS ($38[CH.1]～$3F[CH.8])
;------------------------------------------------------------------------------
_F_PMS          .macro prm,index

        move.b  prm,d0                  ; パラメータ
        rol.b   #4,d0                   ; 4ビット左シフト(はみ出した分は反対側から出てくる)
        andi.b  #%0111_0000,d0          ; パラメータから当該ビット以外をクリア
        lea     fm_vreg_top,a0          ; a0 = 仮想レジスタ先頭アドレス
        move.w  index,d1                ; index(レジスタ番号)
        move.b  (a0,d1.w),d2            ; d2 = fm_mir_top[index];
        andi.b  #%1000_1111,d2          ; 仮想レジスタ値からパラメータの当該ビットをクリア

        or.b    d0,d2                   ; パラメータを仮想レジスタ値に合成
        move.b  d2,(a0,d1.w)            ; 仮想レジスタに書き込み
        _F_SREG d2,index                ; 現物レジスタに書き込み

                .endm

;------------------------------------------------------------------------------
; パラメータ設定 [M] NFRQ ($0F)
;------------------------------------------------------------------------------
_F_NFRQ         .macro prm

        move.b  prm,d0                  ; パラメータ
        andi.b  #%0001_1111,d0          ; パラメータから当該ビット以外をクリア

        lea     fm_vreg_top,a0          ; a0 = 仮想レジスタ先頭アドレス
        move.w  #$000F,d1               ; index(レジスタ番号)はOPM内に1つしかない($0F)
        move.b  (a0,d1.w),d2            ; d2 = fm_mir_top[index];
        andi.b  #%1110_0000,d2          ; 仮想レジスタ値からパラメータの当該ビットをクリア

        or.b    d0,d2                   ; パラメータを仮想レジスタ値に合成
        move.b  d2,(a0,d1.w)            ; 仮想レジスタに書き込み
        _F_SREG d2,#$0F                 ; 現物レジスタに書き込み

                .endm

;------------------------------------------------------------------------------
; パラメータ設定 [M] LFO-W 波形選択 ($1B)
;------------------------------------------------------------------------------
; 備考：bit7:CT1(ADPCMクロック切り替え), bit6:CT2(FDC強制READY)が0になる。
;       問題が起きたら、その際に対応する。
;------------------------------------------------------------------------------
_F_LFOW         .macro prm

        move.b  prm,d0                  ; パラメータ
        andi.b  #%0000_0011,d0          ; パラメータから当該ビット以外をクリア

        lea     fm_vreg_top,a0          ; a0 = 仮想レジスタ先頭アドレス
        move.w  #$001B,d1               ; index(レジスタ番号)はOPM内に1つしかない($1B)
        move.b  (a0,d1.w),d2            ; d2 = fm_mir_top[index];
        andi.b  #%1111_1100,d2          ; 仮想レジスタ値からパラメータの当該ビットをクリア

        or.b    d0,d2                   ; パラメータを仮想レジスタ値に合成
        move.b  d2,(a0,d1.w)            ; 仮想レジスタに書き込み
        _F_SREG d2,#$1B                 ; 現物レジスタに書き込み

                .endm

;------------------------------------------------------------------------------
; パラメータ設定 [M] LFRQ ($18)
;------------------------------------------------------------------------------
_F_LFRQ         .macro prm

        lea     fm_vreg_top,a0          ; a0 = 仮想レジスタ先頭アドレス
        move.w  #$0018,d1               ; index(レジスタ番号)はOPM内に1つしかない($18)

        move.b  prm,(a0,d1.w)           ; 仮想レジスタに書き込み
        _F_SREG prm,#$18                ; 現物レジスタに書き込み

                .endm

;------------------------------------------------------------------------------
; パラメータ設定 [M] AMD ($19)
;------------------------------------------------------------------------------
_F_AMD          .macro prm

        move.b  prm,d0                  ; パラメータ
        andi.b  #%0111_1111,d0          ; bit7:F=0:AMD

        lea     fm_vreg_top,a0          ; a0 = 仮想レジスタ先頭アドレス
        move.w  #$0019,d1               ; index(レジスタ番号)はOPM内に1つしかない($19)

        move.b  d0,(a0,d1.w)            ; 仮想レジスタに書き込み
        _F_SREG d0,#$19                 ; 現物レジスタに書き込み

                .endm

;------------------------------------------------------------------------------
; パラメータ設定 [M] PMD ($19)
;------------------------------------------------------------------------------
_F_PMD          .macro prm

        move.b  prm,d0                  ; パラメータ
        or.b    #%1000_0000,d0          ; bit7:F=1:PMD

        lea     fm_vreg_top,a0          ; a0 = 仮想レジスタ先頭アドレス
        move.w  #$0019,d1               ; index(レジスタ番号)はOPM内に1つしかない($19)

        move.b  d0,(a0,d1.w)            ; 仮想レジスタに書き込み
        _F_SREG d0,#$19                 ; 現物レジスタに書き込み

                .endm

;------------------------------------------------------------------------------
; パラメータ設定 [S] TL ($60[SLOT1]～$7F[SLOT32])
;------------------------------------------------------------------------------
_F_TL           .macro prm,index

        move.b  prm,d0                  ; パラメータ
        andi.b  #%0111_1111,d0          ; パラメータから当該ビット以外をクリア

        lea     fm_vreg_top,a0          ; a0 = 仮想レジスタ先頭アドレス
        move.w  index,d1                ; index(レジスタ番号)

        move.b  d0,(a0,d1.w)            ; 仮想レジスタに書き込み
        _F_SREG d0,index                ; 現物レジスタに書き込み

                .endm

;------------------------------------------------------------------------------
; パラメータ設定 [S] AR ($80[SLOT1]～$9F[SLOT32])
;------------------------------------------------------------------------------
_F_AR           .macro prm,index

        move.b  prm,d0                  ; パラメータ
        andi.b  #%0001_1111,d0          ; パラメータから当該ビット以外をクリア

        lea     fm_vreg_top,a0          ; a0 = 仮想レジスタ先頭アドレス
        move.w  index,d1                ; index(レジスタ番号)
        move.b  (a0,d1.w),d2            ; d2 = fm_mir_top[index];
        andi.b  #%1110_0000,d2          ; 仮想レジスタ値からパラメータの当該ビットをクリア

        or.b    d0,d2                   ; パラメータを仮想レジスタ値に合成
        move.b  d2,(a0,d1.w)            ; 仮想レジスタに書き込み
        _F_SREG d2,index                ; 現物レジスタに書き込み

                .endm

;------------------------------------------------------------------------------
; パラメータ設定 [S] D1R ($A0[SLOT1]～$BF[SLOT32])
;------------------------------------------------------------------------------
_F_D1R          .macro prm,index

        move.b  prm,d0                  ; パラメータ
        andi.b  #%0001_1111,d0          ; パラメータから当該ビット以外をクリア

        lea     fm_vreg_top,a0          ; a0 = 仮想レジスタ先頭アドレス
        move.w  index,d1                ; index(レジスタ番号)
        move.b  (a0,d1.w),d2            ; d2 = fm_mir_top[index];
        andi.b  #%1110_0000,d2          ; 仮想レジスタ値からパラメータの当該ビットをクリア

        or.b    d0,d2                   ; パラメータを仮想レジスタ値に合成
        move.b  d2,(a0,d1.w)            ; 仮想レジスタに書き込み
        _F_SREG d2,index                ; 現物レジスタに書き込み

                .endm

;------------------------------------------------------------------------------
; パラメータ設定 [S] D1L ($E0[SLOT1]～$FF[SLOT32])
;------------------------------------------------------------------------------
_F_D1L          .macro prm,index

        move.b  prm,d0                  ; パラメータ
        rol.b   #4,d0                   ; 4ビット左シフト(はみ出した分は反対側から出てくる)
        andi.b  #%1111_0000,d0          ; パラメータから当該ビット以外をクリア

        lea     fm_vreg_top,a0          ; a0 = 仮想レジスタ先頭アドレス
        move.w  index,d1                ; index(レジスタ番号)
        move.b  (a0,d1.w),d2            ; d2 = fm_mir_top[index];
        andi.b  #%0000_1111,d2          ; 仮想レジスタ値からパラメータの当該ビットをクリア

        or.b    d0,d2                   ; パラメータを仮想レジスタ値に合成
        move.b  d2,(a0,d1.w)            ; 仮想レジスタに書き込み
        _F_SREG d2,index                ; 現物レジスタに書き込み

                .endm
;------------------------------------------------------------------------------
; パラメータ設定 [S] D2R ($C0[SLOT1]～$DF[SLOT32])
;------------------------------------------------------------------------------
_F_D2R          .macro prm,index

        move.b  prm,d0                  ; パラメータ
        andi.b  #%0001_1111,d0          ; パラメータから当該ビット以外をクリア

        lea     fm_vreg_top,a0          ; a0 = 仮想レジスタ先頭アドレス
        move.w  index,d1                ; index(レジスタ番号)
        move.b  (a0,d1.w),d2            ; d2 = fm_mir_top[index];
        andi.b  #%1110_0000,d2          ; 仮想レジスタ値からパラメータの当該ビットをクリア

        or.b    d0,d2                   ; パラメータを仮想レジスタ値に合成
        move.b  d2,(a0,d1.w)            ; 仮想レジスタに書き込み
        _F_SREG d2,index                ; 現物レジスタに書き込み

                .endm

;------------------------------------------------------------------------------
; パラメータ設定 [S] RR ($E0[SLOT1]～$FF[SLOT32])
;------------------------------------------------------------------------------
_F_RR           .macro prm,index

        move.b  prm,d0                  ; パラメータ
        andi.b  #%0000_1111,d0          ; パラメータから当該ビット以外をクリア

        lea     fm_vreg_top,a0          ; a0 = 仮想レジスタ先頭アドレス
        move.w  index,d1                ; index(レジスタ番号)
        move.b  (a0,d1.w),d2            ; d2 = fm_mir_top[index];
        andi.b  #%1111_0000,d2          ; 仮想レジスタ値からパラメータの当該ビットをクリア

        or.b    d0,d2                   ; パラメータを仮想レジスタ値に合成
        move.b  d2,(a0,d1.w)            ; 仮想レジスタに書き込み
        _F_SREG d2,index                ; 現物レジスタに書き込み

                .endm

;------------------------------------------------------------------------------
; パラメータ設定 [S] KS ($80[SLOT1]～$9F[SLOT32])
;------------------------------------------------------------------------------
_F_KS           .macro prm,index

        move.b  prm,d0                  ; パラメータ
        rol.b   #6,d0                   ; 6ビット左シフト(はみ出した分は反対側から出てくる)
        andi.b  #%1100_0000,d0          ; パラメータから当該ビット以外をクリア

        lea     fm_vreg_top,a0          ; a0 = 仮想レジスタ先頭アドレス
        move.w  index,d1                ; index(レジスタ番号)
        move.b  (a0,d1.w),d2            ; d2 = fm_mir_top[index];
        andi.b  #%0011_1111,d2          ; 仮想レジスタ値からパラメータの当該ビットをクリア

        or.b    d0,d2                   ; パラメータを仮想レジスタ値に合成
        move.b  d2,(a0,d1.w)            ; 仮想レジスタに書き込み
        _F_SREG d2,index                ; 現物レジスタに書き込み

                .endm

;------------------------------------------------------------------------------
; パラメータ設定 [S] MUL ($40[SLOT1]～$5F[SLOT32])
;------------------------------------------------------------------------------
_F_MUL          .macro prm,index

        move.b  prm,d0                  ; パラメータ
        andi.b  #%0000_1111,d0          ; パラメータから当該ビット以外をクリア

        lea     fm_vreg_top,a0          ; a0 = 仮想レジスタ先頭アドレス
        move.w  index,d1                ; index(レジスタ番号)
        move.b  (a0,d1.w),d2            ; d2 = fm_mir_top[index];
        andi.b  #%1111_0000,d2          ; 仮想レジスタ値からパラメータの当該ビットをクリア

        or.b    d0,d2                   ; パラメータを仮想レジスタ値に合成
        move.b  d2,(a0,d1.w)            ; 仮想レジスタに書き込み
        _F_SREG d2,index                ; 現物レジスタに書き込み

                .endm

;------------------------------------------------------------------------------
; パラメータ設定 [S] DT1 ($40[SLOT1]～$5F[SLOT32])
;------------------------------------------------------------------------------
_F_DT1          .macro prm,index

        move.b  prm,d0                  ; パラメータ
        rol.b   #4,d0                   ; 4ビット左シフト(はみ出した分は反対側から出てくる)
        andi.b  #%0111_0000,d0          ; パラメータから当該ビット以外をクリア

        lea     fm_vreg_top,a0          ; a0 = 仮想レジスタ先頭アドレス
        move.w  index,d1                ; index(レジスタ番号)
        move.b  (a0,d1.w),d2            ; d2 = fm_mir_top[index];
        andi.b  #%1000_1111,d2          ; 仮想レジスタ値からパラメータの当該ビットをクリア

        or.b    d0,d2                   ; パラメータを仮想レジスタ値に合成
        move.b  d2,(a0,d1.w)            ; 仮想レジスタに書き込み
        _F_SREG d2,index                ; 現物レジスタに書き込み

                .endm

;------------------------------------------------------------------------------
; パラメータ設定 [S] DT2 ($C0[SLOT1]～$DF[SLOT32])
;------------------------------------------------------------------------------
_F_DT2          .macro prm,index

        move.b  prm,d0                  ; パラメータ
        rol.b   #6,d0                   ; 6ビット左シフト(はみ出した分は反対側から出てくる)
        andi.b  #%1100_0000,d0          ; パラメータから当該ビット以外をクリア

        lea     fm_vreg_top,a0          ; a0 = 仮想レジスタ先頭アドレス
        move.w  index,d1                ; index(レジスタ番号)
        move.b  (a0,d1.w),d2            ; d2 = fm_mir_top[index];
        andi.b  #%0011_1111,d2          ; 仮想レジスタ値からパラメータの当該ビットをクリア

        or.b    d0,d2                   ; パラメータを仮想レジスタ値に合成
        move.b  d2,(a0,d1.w)            ; 仮想レジスタに書き込み
        _F_SREG d2,index                ; 現物レジスタに書き込み

                .endm

;------------------------------------------------------------------------------
; FM音源 仮想レジスタを現物レジスタに反映
;------------------------------------------------------------------------------
_F_REFR         .macro index

        lea     fm_vreg_top,a0          ; a0 = 仮想レジスタ先頭アドレス
        move.w  index,d0                ; index
        move.b  (a0,d0.w),d1            ; d1 = fm_mir_top[index];
        _F_SREG d1,index                ; 現物レジスタに書き込み

                .endm

;------------------------------------------------------------------------------
; FM音源 現物レジスタ直接書き込み 
;------------------------------------------------------------------------------
; ・基本的にパラメータ設定マクロ以外からは使用しないこと(仮想レジスタ整合維持)
; ・アセンブラ命令に合わせて引数を src,dst の順に変更
; ・BUSY待ち処理を統合
;------------------------------------------------------------------------------
; BUSYフラグについての実験結果：
;
; - XM6 TypeG 10/24MHz (version 3.37) 及び X68000 Z PE(v 1.7.3)
;   BUSYフラグそのものは立つが、待たなくても鳴る。
;   BUSYフラグの細かい挙動は、XM6 TypeGとZで多少異なるが、どうでも良い。
;   実機の挙動に合わせてBUSY待ち処理を入れるべき。
;
; - 実機 10/16/24MHz (Compact XVI)
;   (a) BUSY待ちをしない
;   (b) FM_SEL($E90001)の前で待たずに、FM_DAT($E90003)の前で待つ
;   (a),(b)は、どちらも鳴らなくなる "ときがある" (鳴ってしまう場合の方が多い)。
;   "鳴らない" の発生率は、10/16/24MHzどれも同じと思われる。
;   必ず、FM_SEL($E90001)の前でBUSY待ちをする必要がある。
;   逆に言えば、FM_SEL($E90001)の前だけで待てば鳴る(数十回確認した限りでは)。
;------------------------------------------------------------------------------
_F_SREG         .macro prm,index

@busy_loop:                             ; BUSYフラグ確認
        move.b  FM_DAT,d7               ; Readすると無条件でステータスレジスタとなる
        andi.b  #$80,d7                 ; bit:7(BUSYフラグ)を抽出
        bne     @busy_loop              ; 1(BUSY)なら待つ(レジスタ書込み時に'0'である必要がある)

        move.b  index,FM_SEL            ; レジスタ選択
        move.b  prm,FM_DAT              ; データ書き込み

                .endm

;------------------------------------------------------------------------------
; メイン処理
;------------------------------------------------------------------------------
main:

; アプリケーション 初期化処理
main_init:

        clr.l   -(sp)                   ; 引数：0
        DOS     _SUPER                  ; $ff20 スーパーバイザモード ON
        addq.l  #4,sp                   ; sp戻し
        move.l  d0,ssp_work             ; ssp保存

        ; 仮想レジスタのクリア(一応) ------------------------------------------
        lea     fm_vreg_top,a0          ; a0 = 仮想レジスタ先頭アドレス
        move.w  #256-1,d7               ; ループ回数-1を設定(dbraはdnをwサイズで参照する)
@@:
        move.b  #$00,(a0,d7.w)          ; fm_vreg_top[dn.w] = 0;
        dbra    d7,@b                   ; dn.w --; → if(dn.w == -1){ ループ終了;}

        ; ※ 以下、全てCH.1を使用

        ; FM音源 初期化 -------------------------------------------------------
        _F_KOFF #0000                   ; [M] KON OFF
        _F_LCEN c_lch_en,#$0020         ; [C] L-chEN  ON / OFF : OFFだと左側の音が鳴らない
        _F_RCEN c_rch_en,#$0020         ; [C] R-chEN  ON / OFF : OFFだと右側の音が鳴らない

        ; VOPM 画面 枠外 ------------------------------------------------------
        _F_CON  c_con,#$20              ; [C] CON     (CH.1) パラメータセット

        ; PROG 枠 -------------------------------------------------------------
        _F_M1SW cm_opmsk_m1,#$0000      ; [C/M] OpMsk M1オペレータ ON / OFF
        _F_C1SW cm_opmsk_c1,#$0000      ; [C/M] OpMsk C1オペレータ ON / OFF
        _F_M2SW cm_opmsk_m2,#$0000      ; [C/M] OpMsk M2オペレータ ON / OFF
        _F_C2SW cm_opmsk_c2,#$0000      ; [C/M] OpMsk C2オペレータ ON / OFF

        _F_AMSE s_ams_en_m1,#$00A0      ; [S] AMS-En M1 ON / OFF
        _F_AMSE s_ams_en_c1,#$00B0      ; [S] AMS-En C1 ON / OFF
        _F_AMSE s_ams_en_m2,#$00A8      ; [S] AMS-En M2 ON / OFF
        _F_AMSE s_ams_en_c2,#$00B8      ; [S] AMS-En C2 ON / OFF
        _F_NE   m_noise_en,#$000F       ; [M] NE ノイズ ON / OFF
        _F_FL   c_fl,#$0020             ; [C] FL
        _F_AMS  c_ams,#$0038            ; [C] AMS
        _F_PMS  c_pms,#$0038            ; [C] PMS
        _F_NFRQ m_nfrq                  ; [M] NFRQ (ノイズ周波数)

        ; LFO 枠 --------------------------------------------------------------
        _F_LFOW m_lfo_w                 ; [M] LFO-W (ノイズ波形選択)
        _F_LFRQ m_lfrq                  ; [M] LFRQ
        _F_AMD  m_amd                   ; [M] AMD
        _F_PMD  m_pmd                   ; [M] PMD

        ; OP 枠 ---------------------------------------------------------------
        _F_TL   s_tl_m1,#$0060          ; [S] TL M1
        _F_TL   s_tl_c1,#$0070          ; [S] TL C1
        _F_TL   s_tl_m2,#$0068          ; [S] TL M2
        _F_TL   s_tl_c2,#$0078          ; [S] TL C2

        _F_AR   s_ar_m1,#$0080          ; [S] AR M1
        _F_AR   s_ar_c1,#$0090          ; [S] AR C1
        _F_AR   s_ar_m2,#$0088          ; [S] AR M2
        _F_AR   s_ar_c2,#$0098          ; [S] AR C2

        _F_D1R  s_d1r_m1,#$00A0         ; [S] D1R M1
        _F_D1R  s_d1r_c1,#$00B0         ; [S] D1R C1
        _F_D1R  s_d1r_m2,#$00A8         ; [S] D1R M2
        _F_D1R  s_d1r_c2,#$00B8         ; [S] D1R C2

        _F_D1L  s_d1l_m1,#$00E0         ; [S] D1L M1
        _F_D1L  s_d1l_c1,#$00F0         ; [S] D1L C1
        _F_D1L  s_d1l_m2,#$00E8         ; [S] D1L M2
        _F_D1L  s_d1l_c2,#$00F8         ; [S] D1L C2

        _F_D2R  s_d2r_m1,#$00C0         ; [S] D1L M1
        _F_D2R  s_d2r_c1,#$00D0         ; [S] D1L C1
        _F_D2R  s_d2r_m2,#$00C8         ; [S] D1L M2
        _F_D2R  s_d2r_c2,#$00D8         ; [S] D1L C2

        _F_RR   s_rr_m1,#$00E0          ; [S] RR M1
        _F_RR   s_rr_c1,#$00F0          ; [S] RR C1
        _F_RR   s_rr_m2,#$00E8          ; [S] RR M2
        _F_RR   s_rr_c2,#$00F8          ; [S] RR C2

        _F_KS   s_ks_m1,#$0080          ; [S] KS M1
        _F_KS   s_ks_c1,#$0090          ; [S] KS C1
        _F_KS   s_ks_m2,#$0088          ; [S] KS M2
        _F_KS   s_ks_c2,#$0098          ; [S] KS C2

        _F_MUL  s_mul_m1,#$0040         ; [S] MUL M1
        _F_MUL  s_mul_c1,#$0050         ; [S] MUL C1
        _F_MUL  s_mul_m2,#$0048         ; [S] MUL M2
        _F_MUL  s_mul_c2,#$0058         ; [S] MUL C2

        _F_DT1  s_dt1_m1,#$0040         ; [S] DT1 M1
        _F_DT1  s_dt1_c1,#$0050         ; [S] DT1 C1
        _F_DT1  s_dt1_m2,#$0048         ; [S] DT1 M2
        _F_DT1  s_dt1_c2,#$0058         ; [S] DT1 C2

        _F_DT2  s_dt2_m1,#$00C0         ; [S] DT2 M1
        _F_DT2  s_dt2_c1,#$00D0         ; [S] DT2 C1
        _F_DT2  s_dt2_m2,#$00C8         ; [S] DT2 M2
        _F_DT2  s_dt2_c2,#$00D8         ; [S] DT2 C2

; アプリケーション 実行処理
main_loop:

        jbsr    Input_1P_CreateData     ; 入力情報作成

        ; Zキーが押されたら音('ド4'C4[261.626Hz]近似値)を鳴らす
        move.w  #BTN_B__,d0             ; d0.w ボタン：Xキー
        move.w  #BS_DOW,d1              ; d1.w 状態  ：押した瞬間
        jbsr    Input_1P_GetState       ; コントローラ n の入力情報を取得する
        tst.w   d0                      ; 0(非成立)か？
        beq     @f                      ; 0(非成立)なら抜ける
        _F_KOFF #0000                   ; [M] KON OFF
        _F_KC   #$3C,#$0028             ; [C] KC  OCT=3, NOTE=$C ('ド4'C4[261.626Hz]近似値)
        _F_KON  #0000                   ; [M] KON ON
@@:
        ; Zキーが離されたら音を消す
        move.w  #BTN_B__,d0             ; d0.w ボタン：Xキー
        move.w  #BS_UP_,d1              ; d1.w 状態  ：離した瞬間
        jbsr    Input_1P_GetState       ; コントローラ n の入力情報を取得する
        tst.w   d0                      ; 0(非成立)か？
        beq     @f                      ; 0(非成立)なら抜ける
        _F_KOFF #0000                   ; [M] KON OFF
@@:
        ; Xキーが押されたら音('レ4'D4[293.665Hz]近似値)を鳴らす
        move.w  #BTN_A__,d0             ; d0.w ボタン：Xキー
        move.w  #BS_DOW,d1              ; d1.w 状態  ：押した瞬間
        jbsr    Input_1P_GetState       ; コントローラ n の入力情報を取得する
        tst.w   d0                      ; 0(非成立)か？
        beq     @f                      ; 0(非成立)なら抜ける
        _F_KOFF #0000                   ; [M] KON OFF
        _F_KC   #$3E,#$0028             ; [C] KC  OCT=3, NOTE=$E ('レ4'D4[293.665Hz]近似値)
        _F_KON  #0000                   ; [M] KON ON
@@:
        ; Xキーが離されたら音を消す
        move.w  #BTN_A__,d0             ; d0.w ボタン：Xキー
        move.w  #BS_UP_,d1              ; d1.w 状態  ：離した瞬間
        jbsr    Input_1P_GetState       ; コントローラ n の入力情報を取得する
        tst.w   d0                      ; 0(非成立)か？
        beq     @f                      ; 0(非成立)なら抜ける
        _F_KOFF #0000                   ; [M] KON OFF
@@:
        ; スペースキーが押されたらアプリ終了
        move.w  #BTN_STA,d0             ; d0.w ボタン：スペースキー
        move.w  #BS_DOW,d1              ; d1.w 状態  ：押した瞬間
        jbsr    Input_1P_GetState       ; コントローラ n の入力情報を取得する
        tst.w   d0                      ; 0(非成立)か？
        beq     @f                      ; 0(非成立)なら抜ける
        jbra    main_release            ; アプリケーション終了処理へ
@@:
        jbra    main_loop               ; 次フレームも継続：メインループ先頭へ

; アプリケーション 終了処理
main_release:

        _F_KOFF #0000                   ; [M] KON OFF

        move.l  ssp_work,-(sp)          ; 引数：起動時に保存しておいたssp
        DOS     _SUPER                  ; $ff20 スーパーバイザモード OFF
        addq.l  #4,sp                   ; sp戻し
        DOS     _EXIT                   ; プログラム終了

                .end main
